var commands = require('./command.js'),
	persistence = require('./persistence.js'),
	mode = -1,
	options = {
		'curry': {
			description: 'Adds a curry to your order.',
			method: function() {
				mode = 0;
			}
		},
		'drink': {
			description: 'Adds a drink to your order.',
			method: function() {
				mode = 1;
			}
		}
	},

help = function() {

console.log('\n\
,╓▄▄▄▄▓▓▓████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▄▄                \n\
,▄▄▓██████▓▌▌▌▄▄▄▄▄╗m#R²╨╙^`````^²¥x▄,          ▀██▄              \n\
▄▄██▀▀,▄æm╗▄▄,,    ,,,,▄▄æ#R²²╙╙╙╙²²¥k╦▄,  ▀k▄         ██▄            \n\
╓▓█▓▀          ,,,   ...         ¬ⁿ²²²*xm╦▄▄▐▀¥▄ ▐▀▄       ▀██           \n\
█▀       ▄R` .    .╙▀▀          ▀            ╙²w▄▀╦ ."-     ▀██          \n\
▄█       Å           ▀          ▐                 %  ²        ▐█▓         \n\
▄█▓           ,,,,     µ           ▄▄▓██▓███████▓▄              ╙██▄       \n\
▄██▀         ▓█████████▓▄          ▓██▀   ,███████▓▓█▓  ╦,,     ≡m═w███▄     \n\
▄██▀▄▀▀▀.      `▀▀▀▀▀▀██████▓█▓     ╙██▄▄▓██▀▀▀▀▌▀▀▀▀▀▀▀`:╛`. ,▄▄▄▄ ..`²▄▀█▌   \n\
▓██╓▀╓ÆÑ,▄▄▄▄,             ▓█∩         ▀▀▀       ██▄,     ,▄▓██▓▀▀▀▀▀█▌,  ╙ ▀█▌ \n\
██ ▌ ║ 4▓▀▀▀▀▀██▌▄▄▓µ      ▓█                     ╙▀▀▀▓▓▓▀▀▀▀   █▌    ╙█▌  } ╙█▓\n\
▓█▐µ ▀     ▐█ └▀▀▀▀     ▄▓█▓▀         ╓▄▄▄▄ ═               ▄▄▓███▓▄   ▐█µ ╟  ██\n\
██▓  ▀w  ╔██        ▄▓██▓          ,,  ▀▀█▌╙^^^^^¬   ,▄▄▓██▀▀. ╒████▓ ▓█  ▌  ██\n\
██▌▀W▄ ╒███▓,  .æÉÑ ▀▀▀█▌       ▀█▀▀▓█ ▓█▀    ,▄▄▓█████▀.    ▄██    ▐█` ▄` ▓█▀\n\
██▄   ▓██████▌▄,       ▀██▓█         ,▄▄▄▓▓██▀▀▀    ██Q,▄▄▓███▀     ,═É ▄██` \n\
██   ████ ██▀▀███▓▓▄▄▄▄▄▄▄▄▄▄▄▓▓▓███▓▀▀▀█▌      ,▄█████▀▀██▀        «▓██`   \n\
▐█µ  ███▌▐█▌  ▄█▌ ▐▀▀▀██▀▀▀▀└▐█▀        ██▄▄▓▓███████  ,██▀        ▄██      \n\
▐█▌  ███████▓▌██▄▄▄▄▄▄██▄▄▄▄▄▄█▄,,▄▄▄▓▓███████▀▀   ██▄▓█▀         ▓█▀       \n\
j█▌  ▀█████████████████████████████████▀▀██        ▄██▓          ▄█         \n\
▐█    ██▓█████████████████████▓██▀╙      ▀█▌    ▄▓██▀           ▓█▀         \n\
▓█    ▐████µ▀█▌  ██   ▀██      ▓█         ▀█▌▄▓██▀           ,▓█▀           \n\
██     ╙███▌▄██▌ ╙██   ▐█µ     ▓█    ,▄▄▓▓███▀Ñ  ,xÆ^ ▄▄▀`,▄██▀             \n\
█▌        ╙▀▀▀████████████████████████▀▀▀   ,▄Æ▀ ,▄#▀▀ ▄▄██▀.               \n\
▐█▄   µ   X▄        .,▄▄▄▄▄,,▄▄,        ,▄#▀▀▄▄4▀▀└,▄▄██▀▀                   \n\
╟█m   V    .▀▀W╦▄,,       ,   ,,╓wwmRÉ▀▌▄Æ▀▀   ▄▄▓██▀▀                       \n\
╟█     .▀¥▄▄,             ,,,,═≡*²^`      ,▄▓██▀▀.                           \n\
^██          .    .                   ,▄▓█▓▀.                                \n\
▀█▌▄                      ,▄▄▓██████▀▀.                                    \n\
▀▀██▓▄▄▄▄▄▄▄▄▄▄▄▄▄▄▓▓███▀▀▀▀                                             \n\
▀▀▀▀▀▀▀▀▀▀▀▀╙                                                       \n\
');
	console.log('What are you even trying to do?');
	process.exit(-2);
};

exports.run = function() {
	/*commands.run(options, process.argv, 1);
	var item = process.argv[4];
	switch (mode) {
		case 0: if (!verifyCurry(item)) help(); break;
		case 1: if (!verifyDrink(item)) help(); break;
		default: help(); break;
	}

	var stage = persistence.getKey('stage');
	if (!stage) {
		stage = {
			date: new Date(),
			items: []
		};
	}

	stage.items.push(item);
	persistence.updateKey('stage', stage);*/
	help();
};
